VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_sdadc.c
/**
  ******************************************************************************
  * @file    stm32f37x_sdadc.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    20-September-2012
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of the Sigma-Delta Analog to Digital Convertor
  *          (SDADC) peripherals:
  *           + Initialization and Configuration
  *           + Regular Channels Configuration
  *           + Injected channels Configuration
  *           + Power saving
  *           + Regular/Injected Channels DMA Configuration
  *           + Interrupts and flags management
  *         
  *  @verbatim
================================================================================
                      ##### How to use this driver #####
================================================================================
    [..]
    (#) Enable the SDADC analog interface by calling
        PWR_SDADCAnalogCmd(PWR_SDADCAnalog_x, Enable);
    (#) Enable the SDADC APB clock to get write access to SDADC registers using
        RCC_APB1PeriphClockCmd() function
        e.g.  To enable access to SDADC1 registers use
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_SDADC1, ENABLE);
    (#) The SDADCs are clocked by APB1.
        In order to get the SDADC running at the typical frequency (6 MHz
        in fast mode), use SDADC prescaler by calling RCC_SDADCCLKConfig() function
        e.g. if APB1 is clocked at 72MHz, to get the SDADC running at 6MHz
        configure the SDADC prescaler at 12 by calling 
        RCC_SDADCCLKConfig(RCC_SDADCCLK_SYSCLK_Div12);
    (#) If required, perform the following configurations:
        (++) Select the reference voltage using SDADC_VREFSelect() function
        (++) Enable the power-down and standby modes using SDADC_PowerDownCmd()
             and SDADC_StandbyCmd() functions respectively
        (++) Enable the slow clock mode (SDADC running at 1.5 MHz) using
             RCC_SDADCCLKConfig() and SDADC_SlowClockCmd() function
             -@@- These configurations are allowed only when the SDADC is disabled.

    (#) Enable the SDADC peripheral using SDADC_Cmd() function.
    (#) Enter initialization mode using SDADC_InitModeCmd() function
        then wait for INITRDY flag to be set to confirm that the SDADC
        is in initialization mode.
    (#) Configure the analog inputs: gain, single ended mode, offset value and
        commmon mode using SDADC_AINInit().
        There are three possible configuration: SDADC_Conf_0, SDADC_Conf_1 and SDADC_Conf_2
    (#) Associate the selected configuration to the channel using SDADC_ChannelConfig()
    (#) For Regular channels group configuration
        (++) use SDADC_Init() function to select the SDADC channel to be used
             for regular conversion, the continuous mode...
             -@@- Only software trigger or synchro with SDADC1 are possible
                  for regular conversion
    (#) For Injected channels group configuration
        (++) Select the SDADC channel to be used for injected conversion 
             using SDADC_InjectedChannelSelect()
        (++) Select the external trigger SDADC_ExternalTrigInjectedConvConfig()
             and the edge (rising, falling or both) using
             SDADC_ExternalTrigInjectedConvEdgeConfig()
             -@@- Software trigger and synchro with SDADC1 are possible
    (#)  Exit initialization mode using SDADC_InitModeCmd() function

  *  @endverbatim
  *         
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f37x_sdadc.h"
#include "stm32f37x_rcc.h"

/** @addtogroup STM32F37x_StdPeriph_Driver
  * @{
  */

/** @defgroup SDADC 
  * @brief SDADC driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* CR2 register Mask */
#define CR2_CLEAR_MASK            ((uint32_t)0xFE30FFFF)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup SDADC_Private_Functions
  * @{
  */

/** @defgroup SDADC_Group1 Initialization and Configuration functions
 *  @brief   Initialization and Configuration functions 
 *
@verbatim    
 ===============================================================================
          ##### Initialization and Configuration functions #####
 ===============================================================================
    [..] This section provides functions allowing to:
        (+) Configure the SDADC analog inputs (gain, offset, single ended...)
        (+) Select the SDADC regular conversion channels
        (+) Enter/Exit the SDADC initialization mode
        (+) SDADC fast conversion conversion mode configuration
        (+) Select the reference voltage
        (+) Enable/disable the SDADC peripheral
        (+) Configure and start the SDADC calibration

@endverbatim
  * @{
  */

/**
  * @brief  Deinitializes SDADCx peripheral registers to their default reset values.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
void SDADC_DeInit(SDADC_TypeDef* SDADCx)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

  if(SDADCx == SDADC1)
  {
    /* Enable SDADC1 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDADC1, ENABLE);
    /* Release SDADC1 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDADC1, DISABLE);
  }
  else if(SDADCx == SDADC2)
  {
    /* Enable SDADC2 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDADC2, ENABLE);
    /* Release SDADC2 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDADC2, DISABLE);
  }
  else
  {
    /* Enable SDADC3 reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDADC3, ENABLE);
    /* Release SDADC3 from reset state */
    RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDADC3, DISABLE);
  }
}

/**
  * @brief  Initializes the SDADCx peripheral according to the specified parameters
  *         in the SDADC_InitStruct.
  * @note   SDADC_FastConversionMode can be modified only if the SDADC is disabled
  *         or the INITRDY flag is set. Otherwise the configuration can't be modified.
  * @note   Channel selection and continuous mode configuration affect only the 
  *         regular channel.
  * @note   Fast conversion mode is regardless of regular/injected conversion mode.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_InitStruct: pointer to an SDADC_InitTypeDef structure that contains
  *         the configuration information for the specified SDADC peripheral.
  * @retval None
  */
void SDADC_Init(SDADC_TypeDef* SDADCx, SDADC_InitTypeDef* SDADC_InitStruct)
{
  uint32_t tmpcr2 = 0;

  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_REGULAR_CHANNEL(SDADC_InitStruct->SDADC_Channel)); 
  assert_param(IS_FUNCTIONAL_STATE(SDADC_InitStruct->SDADC_ContinuousConvMode)); 
  assert_param(IS_FUNCTIONAL_STATE(SDADC_InitStruct->SDADC_FastConversionMode));

  /*---------------------------- SDADCx CR2 Configuration --------------------*/
  /* Get the SDADCx_CR2 value */
  tmpcr2 = SDADCx->CR2;

  /* Clear FAST, RCONT and RCH bits */
  tmpcr2 &= CR2_CLEAR_MASK;
  /* Configure SDADCx: continuous mode for regular conversion, 
     regular channel and fast conversion mode */
  /* Set RCONT bit according to SDADC_ContinuousConvMode value */
  /* Set FAST bit according to SDADC_FastConversionMode value */
  /* Select the regular channel according to SDADC_Channel value */
  tmpcr2 |= (uint32_t)(((uint32_t)SDADC_InitStruct->SDADC_ContinuousConvMode<<22) |
                       (SDADC_InitStruct->SDADC_FastConversionMode<<(uint32_t)24) |
                       (SDADC_InitStruct->SDADC_Channel & SDADC_CR2_RCH));

  /* Write to SDADCx_CR2 */
  SDADCx->CR2 = tmpcr2;
}

/**
  * @brief  Fills each SDADC_InitStruct member with its default value.  
  * @param  SDADC_InitStruct: pointer to an SDADC_InitTypeDef structure which will 
  *         be initialized.
  * @retval None
  */
void SDADC_StructInit(SDADC_InitTypeDef* SDADC_InitStruct)                            
{
  /* Reset SDADC init structure parameters values */

  /* Initialize the SDADC_Channel member */
  SDADC_InitStruct->SDADC_Channel = SDADC_Channel_0;

