VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_sdadc.c
  /* Clear the SDADC_CR2_CALIBCNT bits */
  tmpcr2 &= (uint32_t) (~SDADC_CR2_CALIBCNT);
  /* Set the calibration sequence */
  tmpcr2 |= SDADC_CalibrationSequence;

  /* Write in SDADC_CR2 */
  SDADCx->CR2 = tmpcr2;
}

/**
  * @brief  Launches a request to start the calibration sequence.
  * @note   use SDADC_CalibrationSequenceConfig() function to configure the 
  *         calibration sequence then call SDADC_StartCalibration() to start the 
  *         calibration process.  
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
void SDADC_StartCalibration(SDADC_TypeDef* SDADCx)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

  /* Request a start of the calibration sequence */
  SDADCx->CR2 |= (uint32_t)SDADC_CR2_STARTCALIB;
}

/**
  * @}
  */

/** @defgroup SDADC_Group2 Regular Channels Configuration functions
 *  @brief   Regular Channels Configuration functions 
 *
@verbatim   
 ===============================================================================
          ##### Regular Channels Configuration functions ##### 
 ===============================================================================  
    [..] This section provides functions allowing to manage the SDADC regular channels,
         it is composed of 3 sub sections: 
        (+) Configuration and management functions for regular channels:
           (++) Select the channel to be used for regular conversion using
                 SDADC_ChannelSelect() (*)
           (++) Activate the continuous Mode using SDADC_ContinuousModeCmd() (*)
           (++) Perform a software start trigger using SDADC_SoftwareStartConv()
           (++) For SDADC2 and SDADC3, Enable synchronization with SDADC1 using
                 SDADC_RegularSynchroSDADC1()
              -@@- Please Note that the following features for regular channels
                   can be configurated using the SDADC_Init() function:
           (++) Channel selection
           (++) Continuous mode activation
        (+) Get the regular conversion data: Use SDADC_GetConversionValue() to 
            read the conversion value for regular conversion
        (+) Get the SDADC2/SDADC3 regular conversion data synchronized with SDADC1
            Use SDADC_GetConversionSDADC12Value()/SDADC_GetConversionSDADC13Value to 
            read the conversion value of SDADC1 regular conversion concatenated to
            SDADC2/SDADC3 regular conversion
@endverbatim
  * @{
  */

/**
  * @brief  Selects the SDADC channel to be used for regular conversion.
  * @note   Just one channel of the 9 available channels can be selected.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: The SDADC regular channel.
  *          This parameter can be one of the following values:
  *            @arg SDADC_Channel_0: SDADC Channel 0 selected
  *            @arg SDADC_Channel_1: SDADC Channel 1 selected
  *            @arg SDADC_Channel_2: SDADC Channel 2 selected
  *            @arg SDADC_Channel_3: SDADC Channel 3 selected
  *            @arg SDADC_Channel_4: SDADC Channel 4 selected
  *            @arg SDADC_Channel_5: SDADC Channel 5 selected
  *            @arg SDADC_Channel_6: SDADC Channel 6 selected
  *            @arg SDADC_Channel_7: SDADC Channel 7 selected
  *            @arg SDADC_Channel_8: SDADC Channel 8 selected
  * @retval None
  */
void SDADC_ChannelSelect(SDADC_TypeDef* SDADCx, uint32_t SDADC_Channel)
{
uint32_t tmpcr2;

  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_REGULAR_CHANNEL(SDADC_Channel));

  /* Get SDADC_CR2 register value */
  tmpcr2 = SDADCx->CR2;

  /* Clear the RCH[3:0] bits */
  tmpcr2 &= (uint32_t) (~SDADC_CR2_RCH);
  /* Select the regular channel */
  tmpcr2 |= (uint32_t) (SDADC_Channel & 0xFFFF0000);

  /* Write in SDADC_CR2 register */
  SDADCx->CR2 = tmpcr2;
}

/**
  * @brief  Enables or disables the SDADC continuous conversion mode.
  *         When enabled, the regular channel is converted repeatedly after each
  *         conversion request.
  *         When disabled, the regular channel is converted once for each
  *         conversion request.     
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC continuous conversion mode
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDADC_ContinuousModeCmd(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected SDADC continuous conversion mode */
    SDADCx->CR2 |= (uint32_t)SDADC_CR2_RCONT;
  }
  else
  {
    /* Disable the selected SDADC continuous conversion mode */
    SDADCx->CR2 &= (uint32_t)(~SDADC_CR2_RCONT);
  }
}

/**
  * @brief  Enables the selected SDADC software start conversion of the regular channels.
  * @note   If the flag SDADC_FLAG_RCIP is set or INIT bit is set, calling this
  *         function SDADC_SoftwareStartConv() has no effect.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
void SDADC_SoftwareStartConv(SDADC_TypeDef* SDADCx)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

  /* Enable the selected SDADC conversion for regular group */
  SDADCx->CR2 |= (uint32_t)SDADC_CR2_RSWSTART;
}

/**
  * @brief  Returns the last SDADC conversion result data for regular channel.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval The Data conversion value.
  */
int16_t SDADC_GetConversionValue(SDADC_TypeDef* SDADCx)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

  /* Return the selected SDADC conversion value for regular channel */
  return (int16_t) SDADCx->RDATAR;
}

/**
  * @brief  Launches SDADC2/SDADC3 regular conversion synchronously with SDADC1.
  * @note   This feature is available only on SDADC2 and SDADC3.
  * @param  SDADCx: where x can be 2 or 3 to select the SDADC peripheral.
  *         When enabled, a regular conversion is launched at the same moment
  *         that a regular conversion is launched in SDADC1.
  *         When disabled, do not launch a regular conversion synchronously with SDADC1.
  * @retval None
  */
void SDADC_RegularSynchroSDADC1(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_SLAVE_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable synchronization with SDADC1 on regular conversions */
    SDADCx->CR1 |= SDADC_CR1_RSYNC;
  }
  else
  {
    /* Disable synchronization with SDADC1 on regular conversions */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_RSYNC;
  }
}

/**
  * @brief  Returns the last conversion result data for regular channel of SDADC1 and SDADC2.
  *         RSYNC bit of the SDADC2 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC2.
  *         In 16-bit MSB: the regular conversion data for SDADC2.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC2 is set.  
  *         In 16-bit LSB: the regular conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC1 is set.    
  */
uint32_t SDADC_GetConversionSDADC12Value(void)
{
  /* Return the selected conversion value for regular channel of SDADC1 and SDADC2*/
  return (uint32_t) SDADC1->RDATA12R;
}

/**
  * @brief  Returns the last conversion result data for regular channel of SDADC1 and SDADC3.
  *         RSYNC bit of the SDADC3 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC3.
  *         In 16-bit MSB: the regular conversion data for SDADC3.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC3 is set.  
  *         In 16-bit LSB: the regular conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_REOC of SDADC1 is set.
  */
uint32_t SDADC_GetConversionSDADC13Value(void)
{
  /* Return the selected conversion value for regular channel of SDADC1 and SDADC3*/
  return (uint32_t) SDADC1->RDATA13R;
}

/**
  * @}
  */

/** @defgroup SDADC_Group3 Injected channels Configuration functions
 *  @brief   Injected channels Configuration functions 
 *
@verbatim   
 ===============================================================================
            ##### Injected channels Configuration functions  #####
 ===============================================================================  

    [..] This section provide functions allowing to configure the SDADC Injected
         channels, it is composed of 2 sub sections:

