VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_sdadc.c
         (#) Configuration functions for Injected channels: This subsection provides 
             functions allowing to configure the SDADC injected channels:
             (++) Select the configuration  for the SDADC injected channel
             (++) Activate the continuous Mode  
             (++) External/software trigger source   
             (++) External trigger edge (rising, falling, rising & falling)

         (#) Get injected channel conversion data: This subsection provides an
             important function in the SDADC peripheral since it returns the
             converted data of a specific injected channel.

@endverbatim
  * @{
  */

/**
  * @brief  Enables the selected SDADC software start conversion of the injected 
  *         channels.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval None
  */
void SDADC_SoftwareStartInjectedConv(SDADC_TypeDef* SDADCx)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

  /* Start a conversion of the injected group of channels */
  SDADCx->CR2 |= (uint32_t)SDADC_CR2_JSWSTART;
}
 
/**
  * @brief  Selects the SDADC injected channel(s).
  * @note   When selected, the SDADC channel is part of the injected group
  *         By default, channel 0 is selected
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: The SDADC injected channel.
  *          This parameter can be one or any combination of the following values:
  *            @arg SDADC_Channel_0: SDADC Channel 0 selected
  *            @arg SDADC_Channel_1: SDADC Channel 1 selected
  *            @arg SDADC_Channel_2: SDADC Channel 2 selected
  *            @arg SDADC_Channel_3: SDADC Channel 3 selected
  *            @arg SDADC_Channel_4: SDADC Channel 4 selected
  *            @arg SDADC_Channel_5: SDADC Channel 5 selected
  *            @arg SDADC_Channel_6: SDADC Channel 6 selected
  *            @arg SDADC_Channel_7: SDADC Channel 7 selected
  *            @arg SDADC_Channel_8: SDADC Channel 8 selected
  * @retval None
  */
void SDADC_InjectedChannelSelect(SDADC_TypeDef* SDADCx, uint32_t SDADC_Channel)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_INJECTED_CHANNEL(SDADC_Channel));

  /* Select the SDADC injected channel */
  SDADCx->JCHGR = (uint32_t) (SDADC_Channel & 0x0000FFFF);
}

/**
  * @brief  Enables or disables delayed start of injected conversions
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC delay start of injected
  *         conversions. This parameter can be: ENABLE or DISABLE.
  *         When disabled, injected conversions begin as soon as possible after
  *         the request.
  *         When enabled, after a request for injected conversion the SDADC waits
  *         a fixed interval before launching the conversion.
  * @retval None
  */
void SDADC_DelayStartInjectedConvCmd(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable delay start of injected conversions */
    SDADCx->CR2 |= (uint32_t) (SDADC_CR2_JDS);
  }
  else
  {
    /* Disable delay start of injected conversions */
    SDADCx->CR2 &= (uint32_t) ~(SDADC_CR2_JDS);
  }
}

/**
  * @brief  Enables or disables the continuous mode for injected channels for
  *         the specified SDADC
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC continuous mode
  *         on injected channels. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDADC_InjectedContinuousModeCmd(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the SDADC continuous mode for injected channels */
    SDADCx->CR2 |= (uint32_t)SDADC_CR2_JCONT;
  }
  else
  {
    /* Disable the SDADC continuous mode for injected channels */
    SDADCx->CR2 &= (uint32_t)(~SDADC_CR2_JCONT);
  }
}

/**
  * @brief  Configures the SDADCx external trigger for injected channels conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_ExternalTrigInjecConv: specifies the SDADC trigger to start injected 
  *    conversion. This parameter can be one of the following values:
  *            @arg SDADC_ExternalTrigInjecConv_T13_CC1: Timer13 capture compare1 selected 
  *            @arg SDADC_ExternalTrigInjecConv_T14_CC1: Timer14 TRGO event selected 
  *            @arg SDADC_ExternalTrigInjecConv_T16_CC1: Timer16 TRGO event selected
  *            @arg SDADC_ExternalTrigInjecConv_T17_CC1: Timer17 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T12_CC1: Timer12 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T12_CC2: Timer12 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T15_CC2: Timer15 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T2_CC3: Timer2 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T2_CC4: Timer2 capture compare4 selected
  *            @arg SDADC_ExternalTrigInjecConv_T3_CC1: Timer3 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T3_CC2: Timer3 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T3_CC3: Timer3 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC1: Timer4 capture compare1 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC2: Timer4 capture compare2 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC3: Timer4 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T19_CC2: Timer19 capture compare2 selected 
  *            @arg SDADC_ExternalTrigInjecConv_T19_CC3: Timer19 capture compare3 selected
  *            @arg SDADC_ExternalTrigInjecConv_T19_CC4: Timer19 capture compare4 selected
  *            @arg SDADC_ExternalTrigInjecConv_T4_CC4: Timer4 capture compare4 selected
  *            @arg SDADC_ExternalTrigInjecConv_Ext_IT11: External interrupt line 11 event selected
  *            @arg SDADC_ExternalTrigInjecConv_Ext_IT15: External interrupt line 15 event selected
  * @retval None
  */
void SDADC_ExternalTrigInjectedConvConfig(SDADC_TypeDef* SDADCx, uint32_t SDADC_ExternalTrigInjecConv)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_EXT_INJEC_TRIG(SDADC_ExternalTrigInjecConv));

  /* Get the old register value */
  tmpreg = SDADCx->CR2;

  /* Clear the old external trigger selection for injected group */
  tmpreg &= (uint32_t) (~SDADC_CR2_JEXTSEL);
  /* Set the external event selection for injected group */
  tmpreg |= SDADC_ExternalTrigInjecConv;

  /* Store the new register value */
  SDADCx->CR2 = tmpreg;
}

/**
  * @brief  Configures the SDADCx external trigger edge for injected channels conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_ExternalTrigInjecConvEdge: specifies the SDADC external trigger
  *         edge to start injected conversion.
  *          This parameter can be one of the following values:
  *            @arg SDADC_ExternalTrigInjecConvEdge_None: external trigger disabled for
  *          injected conversion
  *            @arg SDADC_ExternalTrigInjecConvEdge_Rising: Each rising edge on the selected
  *          trigger makes a request to launch a injected conversion
  *            @arg SDADC_ExternalTrigInjecConvEdge_Falling: Each falling edge on the selected
  *          trigger makes a request to launch a injected conversion
  *            @arg SDADC_ExternalTrigInjecConvEdge_RisingFalling: Both rising edges and 
  *          falling edges on the selected trigger make requests to launch injected conversions.
  * @retval None
  */
void SDADC_ExternalTrigInjectedConvEdgeConfig(SDADC_TypeDef* SDADCx, uint32_t SDADC_ExternalTrigInjecConvEdge)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_EXT_INJEC_TRIG_EDGE(SDADC_ExternalTrigInjecConvEdge));

  /* Get the old register value */
  tmpreg = SDADCx->CR2;

  /* Clear the old external trigger edge for injected group */
  tmpreg &= (uint32_t) (~SDADC_CR2_JEXTEN);
  /* Set the new external trigger edge for injected group */
  tmpreg |= SDADC_ExternalTrigInjecConvEdge;

  /* Store the new register value */
  SDADCx->CR2 = tmpreg;
}

/**
  * @brief  Returns the injected channel most recently converted for
  *         the specified SDADC
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @retval The most recently converted SDADC injected channel.
  *          This parameter can be one of the following values:
  *            @arg 0x00000001: SDADC_Channel_0 is recently converted
  *            @arg 0x00010002: SDADC_Channel_1 is recently converted
  *            @arg 0x00020004: SDADC_Channel_2 is recently converted
  *            @arg 0x00030008: SDADC_Channel_3 is recently converted
  *            @arg 0x00040010: SDADC_Channel_4 is recently converted
  *            @arg 0x00050020: SDADC_Channel_5 is recently converted
  *            @arg 0x00060040: SDADC_Channel_6 is recently converted
  *            @arg 0x00070080: SDADC_Channel_7 is recently converted
  *            @arg 0x00080100: SDADC_Channel_8 is recently converted
  */
uint32_t SDADC_GetInjectedChannel(SDADC_TypeDef* SDADCx)
{
  uint32_t temp = 0;
  
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

  /* Get the injected channel most recently converted */
  temp = (uint32_t)(SDADCx->JDATAR>>16);
  temp = (uint32_t) (((uint32_t)1<<temp) | (temp<<(uint32_t)16));

  /* Returns the injected channel most recently converted */
  return (uint32_t) (temp);
}

/**
  * @brief  Returns the SDADC injected channel conversion result
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_Channel: the most recently converted SDADC injected channel.
  *          This parameter can be one of the following values:
  *            @arg 0x00000001: SDADC_Channel_0 is recently converted 
  *            @arg 0x00010002: SDADC_Channel_1 is recently converted
  *            @arg 0x00020004: SDADC_Channel_2 is recently converted
  *            @arg 0x00030008: SDADC_Channel_3 is recently converted
  *            @arg 0x00040010: SDADC_Channel_4 is recently converted
  *            @arg 0x00050020: SDADC_Channel_5 is recently converted
  *            @arg 0x00060040: SDADC_Channel_6 is recently converted
  *            @arg 0x00070080: SDADC_Channel_7 is recently converted
  *            @arg 0x00080100: SDADC_Channel_8 is recently converted
  * @retval The injected data conversion value.
  */
int16_t SDADC_GetInjectedConversionValue(SDADC_TypeDef* SDADCx, uint32_t* SDADC_Channel)
{
  uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));

