VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_sdadc.c
  /* Get SDADC_JDATAR register */
  tmp = (uint32_t)SDADCx->JDATAR;

  /* Get the injected channel most recently converted */
   *(uint32_t*)SDADC_Channel = (uint32_t) ((uint32_t)((tmp>>8) &0xffff0000) | (((uint32_t)1<<(tmp>>24))));

  /* Returns the injected channel conversion data */
  return (int16_t) ((uint32_t)(tmp & 0x0000FFFF));
}

/**
  * @brief  Launches injected conversion synchronously with SDADC1.
  * @note   This feature is available only on SDADC2 and SDADC3.
  * @param  SDADCx: where x can be 2 or 3 to select the SDADC peripheral.
  * @param  NewState: new state of the selected SDADC synchronization with SDADC1
  *          This parameter can be: ENABLE or DISABLE.
  *         When enabled, An injected conversion is launched at the same moment
  *         that an injected conversion is launched in SDADC1.
  *         When disabled, do not launch an injected conversion synchronously with SDADC1.
  * @retval None
  */
void SDADC_InjectedSynchroSDADC1(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_SLAVE_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable synchronization with SDADC1 on injected conversions */
    SDADCx->CR1 |= SDADC_CR1_JSYNC;
  }
  else
  {
    /* Disable synchronization with SDADC1 on injected conversions */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_JSYNC;
  }
}

/**
  * @brief  Returns the last conversion result data for injected channel of SDADC1 and SDADC2.
  *         JSYNC bit of the SDADC2 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC2.
  *         In 16-bit MSB: the regular conversion data for SDADC2.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC2 is set.  
  *         In 16-bit LSB: the regular conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC1 is set.    
  */
uint32_t SDADC_GetInjectedConversionSDADC12Value(void)
{
  /* Return the selected conversion value for injected channel of SDADC1 and SDADC2*/
  return (uint32_t) SDADC1->JDATA12R;
}

/**
  * @brief  Returns the last conversion result data for injected channel of SDADC1 and SDADC3.
  *         JSYNC bit of the SDADC3 should be already set.
  * @param  None
  * @retval The Data conversion value for SDADC1 and SDADC3.
  *         In 16-bit MSB: the injected conversion data for SDADC3.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC3 is set.  
  *         In 16-bit LSB: the injected conversion data for SDADC1.
  *          This data is valid only when the flag SDADC_FLAG_JEOC of SDADC1 is set.
  */
uint32_t SDADC_GetInjectedConversionSDADC13Value(void)
{
  /* Return the selected conversion value for injected channel of SDADC1 and SDADC3*/
  return (uint32_t) SDADC1->JDATA13R;
}

/**
  * @}
  */

/** @defgroup SDADC_Group4 Power saving functions
 *  @brief   Power saving functions 
 *
@verbatim   
 ===============================================================================
          ##### Power saving functions #####
 ===============================================================================  
    [..] This section provides functions allowing to reduce power consumption: 
        (+) Enable the power down mode when idle using SDADC_PowerDownCmd();
        (+) Enable the standby mode when idle using SDADC_StandbyCmd();
        (+) Enable the slow clock mode using SDADC_SlowClockCmd()

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the SDADC power down mode when idle.
  * @note   SDADC power down mode when idle is used to cut the consumption when
  *         the SDADC is not converting (when idle).
  * @note   When the SDADC is in power down mode and a conversion is requested, 
  *         the SDADC takes 100us to stabilize before launching the conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.  
  * @param  NewState: new state of the selected SDADC power down mode when idle
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDADC_PowerDownCmd(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the SDADC power-down when idle */
    SDADCx->CR1 |= SDADC_CR1_PDI;
  }
  else
  {
    /* Disable the SDADCx power-down when idle */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_PDI;
  }
}

/**
  * @brief  Enables or disables the SDADC standby mode when idle.
  * @note   SDADC standby mode when idle is used to cut the consumption when
  *         the SDADC is not converting (when idle).
  * @note   When the SDADC is in standby mode and a conversion is requested, 
  *         the SDADC takes 50us to stabilize before launching the conversion.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.  
  * @param  NewState: new state of the selected SDADC standby mode when idle
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDADC_StandbyCmd(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  
  if (NewState != DISABLE)
  {
    /* Enable the standby mode when idle */
    SDADCx->CR1 |= SDADC_CR1_SBI;
  }
  else
  {
    /* Disable the standby mode when idle */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_SBI;
  }
}

/**
  * @brief  Enables or disables the SDADC in slow clock mode.
  * @note   Slow clock mode (where the SDADC clock frequency should be 1.5MHz)
  *         allowing a lower level of current consumption as well as operation
  *         at a lower minimum voltage.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.  
  * @param  NewState: new state of the selected SDADC slow clock mode
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDADC_SlowClockCmd(SDADC_TypeDef* SDADCx, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the slow clock mode */
    SDADCx->CR1 |= SDADC_CR1_SLOWCK;
  }
  else
  {
    /* Disable the slow clock mode */
    SDADCx->CR1 &= (uint32_t)~SDADC_CR1_SLOWCK;
  }
}

/**
  * @}
  */

/** @defgroup SDADC_Group5 Regular/Injected Channels DMA Configuration function
 *  @brief   Regular/Injected Channels DMA Configuration functions 
 *
@verbatim   
 ===============================================================================
          ##### Regular Channels DMA Configuration functions ##### 
 ===============================================================================  
    [..] This section provides functions allowing to configure the DMA for SDADC regular 
         or injected channels.
    [..] Since converted value is stored into a unique data register, it is useful
         to use DMA for conversion of more than one channel.
         This avoids the loss of the data already stored in the SDADC Data register. 
         When the DMA is enabled for regular/injected channel (using the SDADC_DMAConfig()
         function), after each conversion of a regular/injected channel,
         a DMA request is generated.

@endverbatim
  * @{
  */

/**
  * @brief  Configures the DMA transfer for regular/injected conversions.  
  * @note   DMA requests can't be enabled for both regular and injected conversions.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_DMATransfer: Specifies the SDADC DMA transfer.
  *          This parameter can be one of the following values:
  *          @arg SDADC_DMATransfer_Regular: When enabled, DMA manages reading the 
  *          data for the regular channel.
  *          @arg SDADC_DMATransfer_Injected: When enabled, DMA manages reading the
  *          data for the injected channel.
  * @param  NewState Indicates the new state of the SDADC DMA interface.
  *           This parameter can be: ENABLE or DISABLE.  
  * @retval None
  */
void SDADC_DMAConfig(SDADC_TypeDef* SDADCx, uint32_t SDADC_DMATransfer, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_DMA_TRANSFER(SDADC_DMATransfer));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the DMA transfer */
    SDADCx->CR1 |= SDADC_DMATransfer;
  }
  else
  {
    /* Disable the DMA transfer */
    SDADCx->CR1 &= (uint32_t)(~SDADC_DMATransfer);
  }
}

/**
  * @}
  */

/** @defgroup SDADC_Group6 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
@verbatim   
 ===============================================================================
          ##### Interrupts and flags management functions ##### 
 ===============================================================================  
    [..] This section provides functions allowing to configure the SDADC Interrupts and
         get the status and clear flags and Interrupts pending bits.

