VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_sdadc.c
    [..] The SDADC provide 5 Interrupts sources and 10 Flags which can be divided into 3 groups:
  
  *** Flags and Interrupts for SDADC regular channels ***
  ======================================================  
    [..]
        (+)Flags :
           (##) SDADC_FLAG_ROVR : Overrun detection when regular converted data are lost.
           (##) SDADC_FLAG_REOC : Regular channel end of conversion.
           (##) SDADC_FLAG_RCIP: Regular conversion in progress.
     
        (+)Interrupts :
           (##) SDADC_IT_REOC : specifies the interrupt source for end of regular conversion event.
           (##) SDADC_IT_ROVRF : specifies the interrupt source for regular conversion overrun event.
  
  
  *** Flags and Interrupts for SDADC Injected channels ***
  ======================================================
    [..]
        (+)Flags :
           (##) SDADC_FLAG_JEOC : Injected channel end of conversion event.
           (##) SDADC_FLAG_JOVR: Injected channel Overrun detection event.
           (##) SDADC_FLAG_JCIP: Injected channel conversion in progress.

        (+)Interrupts :
           (##) SDADC_IT_JEOC: specifies the interrupt source for end of injected
                        conversion event.
           (##) SDADC_IT_JOVR: specifies the interrupt source for injected conersion
                        overrun event.

  *** General Flags and Interrupts for the SDADC ***
  ================================================
    [..]
        (+)Flags :
           (##) SDADC_FLAG_EOCAL: specifies the end of calibration event.
           (##) SDADC_FLAG_CALIBIP: specifies that calibration is in progress.
           (##) SDADC_FLAG_STABIP:  specifies that stabilization is in progress.
           (##) SDADC_FLAG_INITRDY: specifies that initialization mode is ready .

        (+)Interrupts :
           (##) SDADC_IT_EOCAL : specifies the interrupt source for end of calibration event.

    [..] User should identify which mode will be used in his application to manage 
         the SDADC controller events: Polling mode or Interrupt mode.

    [..] In the Polling Mode it is advised to use the following functions:
         (+) SDADC_GetFlagStatus(): to check if flags events occur.
         (+) SDADC_ClearFlag()    : to clear the flags events.

    [..] In the Interrupt Mode it is advised to use the following functions:
         (+) SDADC_ITConfig()         : to enable or disable the interrupt source.
         (+) SDADC_GetITStatus()      : to check if Interrupt occurs.
         (+) SDADC_ClearITPendingBit(): to clear the Interrupt pending Bit 
                                        (corresponding Flag). 
@endverbatim
  * @{
  */ 

/**
  * @brief  Enables or disables the specified SDADC interrupts.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_IT: specifies the SDADC interrupt sources to be enabled or disabled. 
  *          This parameter can be one of the following values:
  *            @arg SDADC_IT_EOCAL: End of calibration interrupt
  *            @arg SDADC_IT_JEOC: End of injected conversion interrupt
  *            @arg SDADC_IT_JOVR: Injected conversion overrun interrupt
  *            @arg SDADC_IT_REOC: End of regular conversion interrupt
  *            @arg SDADC_IT_ROVR: Regular conversion overrun interrupt
  * @param  NewState: new state of the specified SDADC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDADC_ITConfig(SDADC_TypeDef* SDADCx, uint32_t SDADC_IT, FunctionalState NewState)  
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  assert_param(IS_SDADC_IT(SDADC_IT)); 

  if (NewState != DISABLE)
  {
    /* Enable the selected SDADC interrupts */
    SDADCx->CR1 |= SDADC_IT;
  }
  else
  {
    /* Disable the selected SDADC interrupts */
    SDADCx->CR1 &= ((uint32_t)~SDADC_IT);
  }
}

/**
  * @brief  Checks whether the specified SDADC flag is set or not.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_FLAG: specifies the flag to check. 
  *          This parameter can be one of the following values:
  *            @arg SDADC_FLAG_EOCAL: End of calibration flag
  *            @arg SDADC_FLAG_JEOC: End of injected conversion flag
  *            @arg SDADC_FLAG_JOVR: Injected conversion overrun flag
  *            @arg SDADC_FLAG_REOC: End of regular conversion flag
  *            @arg SDADC_FLAG_ROVR: Regular conversion overrun flag
  *            @arg SDADC_FLAG_CALIBIP:Calibration in progress status flag
  *            @arg SDADC_FLAG_JCIP: Injected conversion in progress status flag
  *            @arg SDADC_FLAG_RCIP: Regular conversion in progress status flag
  *            @arg SDADC_FLAG_STABIP: Stabilization in progress status flag
  *            @arg SDADC_FLAG_INITRDY: Initialization mode is ready
  * @retval The new state of SDADC_FLAG (SET or RESET).
  */
FlagStatus SDADC_GetFlagStatus(SDADC_TypeDef* SDADCx, uint32_t SDADC_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_GET_FLAG(SDADC_FLAG));

  /* Check the status of the specified SDADC flag */
  if ((SDADCx->ISR & SDADC_FLAG) != (uint32_t)RESET)
  {
    /* SDADC_FLAG is set */
    bitstatus = SET;
  }
  else
  {
    /* SDADC_FLAG is reset */
    bitstatus = RESET;
  }
  /* Return the SDADC_FLAG status */
  return  bitstatus;
}

/**
  * @brief  Clears the SDADCx pending flags.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_FLAG: specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg SDADC_FLAG_EOCAL: End of calibration flag
  *            @arg SDADC_FLAG_JOVR: Injected conversion overrun flag
  *            @arg SDADC_FLAG_ROVR: Regular conversion overrun flag
  * @retval None
  */
void SDADC_ClearFlag(SDADC_TypeDef* SDADCx, uint32_t SDADC_FLAG)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_CLEAR_FLAG(SDADC_FLAG));

