VCVRack/Rack/plugins/community/repos/Southpole/eurorack/stmlib/third_party/STM/STM32F37x_StdPeriph_Driver/src/stm32f37x_sdadc.c
  /* Clear the selected SDADC flags */
  SDADCx->CLRISR |= (uint32_t)SDADC_FLAG;
}

/**
  * @brief  Checks whether the specified SDADC interrupt has occurred or not.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_IT: specifies the SDADC interrupt source to check. 
  *          This parameter can be one of the following values:
  *            @arg SDADC_IT_EOCAL: End of calibration flag 
  *            @arg SDADC_IT_JEOC: End of injected conversion flag
  *            @arg SDADC_IT_JOVR: Injected conversion overrun flag
  *            @arg SDADC_IT_REOC: End of regular conversion flag
  *            @arg SDADC_IT_ROVR: Regular conversion overrun flag
  * @retval The new state of SDADC_IT (SET or RESET).
  */
ITStatus SDADC_GetITStatus(SDADC_TypeDef* SDADCx, uint32_t SDADC_IT)
{
  ITStatus bitstatus = RESET;
  uint32_t itstatus = 0, enablestatus = 0;
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_GET_IT(SDADC_IT));

  /* Get the SDADC interrupt pending status */
  itstatus = (uint32_t) (SDADC_IT & SDADCx->ISR);
  /* Get the SDADC IT enable bit status */
  enablestatus = (SDADCx->CR1 & (uint32_t)SDADC_IT);

  /* Check the status of the specified SDADC interrupt */
  if ((itstatus != (uint32_t)RESET) && (enablestatus != (uint32_t)RESET))
  {
    /* SDADC_IT is set */
    bitstatus = SET;
  }
  else
  {
    /* SDADC_IT is reset */
    bitstatus = RESET;
  }
  /* Return the SDADC_IT status */
  return  bitstatus;
}

/**
  * @brief  Clears the SDADCx interrupt pending bits.
  * @param  SDADCx: where x can be 1, 2 or 3 to select the SDADC peripheral.
  * @param  SDADC_IT: specifies the SDADC interrupt pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg SDADC_IT_EOCAL: End of calibration flag 
  *            @arg SDADC_IT_JOVR: Injected conversion overrun flag
  *            @arg SDADC_IT_ROVR: Regular conversion overrun flag
  * @retval None
  */
void SDADC_ClearITPendingBit(SDADC_TypeDef* SDADCx, uint32_t SDADC_IT)
{
  /* Check the parameters */
  assert_param(IS_SDADC_ALL_PERIPH(SDADCx));
  assert_param(IS_SDADC_CLEAR_IT(SDADC_IT));

  /* Clear the selected SDADC interrupt pending bits */
  SDADCx->CLRISR |= (uint32_t)SDADC_IT;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
